vmux0.0.13/socialNetwork_bridge_27vms_2048rps_rep0.log
Running 1m test @ http://10.1.0.44:8080
  8 threads and 16 connections

  Thread calibration: mean lat.: 2.728ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.579ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.653ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.590ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.647ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.679ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.602ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 2.696ms, rate sampling interval: 12ms

-----------------------------------------------------------------------
Test Results @ http://10.1.0.44:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.00ms    3.93ms  18.46ms   90.31%
    Req/Sec   268.12    154.80   700.00     66.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.59ms
 75.000%    2.82ms
 90.000%    6.82ms
 99.000%   18.46ms
 99.900%   42.49ms
 99.990%   72.06ms
 99.999%   83.14ms
100.000%   89.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.701     0.000000            1         1.00
       1.037     0.100000        10484         1.11
       1.164     0.200000        20988         1.25
       1.313     0.300000        31466         1.43
       1.439     0.400000        41990         1.67
       1.593     0.500000        52422         2.00
       1.700     0.550000        57670         2.22
       1.841     0.600000        62888         2.50
       2.032     0.650000        68123         2.86
       2.337     0.700000        73372         3.33
       2.815     0.750000        78617         4.00
       3.227     0.775000        81223         4.44
       3.941     0.800000        83839         5.00
       4.711     0.825000        86461         5.71
       5.363     0.850000        89084         6.67
       6.007     0.875000        91702         8.00
       6.375     0.887500        93017         8.89
       6.823     0.900000        94328        10.00
       7.303     0.912500        95635        11.43
       7.895     0.925000        96939        13.33
       8.583     0.937500        98254        16.00
       9.015     0.943750        98914        17.78
       9.479     0.950000        99562        20.00
      10.031     0.956250       100216        22.86
      10.647     0.962500       100877        26.67
      11.399     0.968750       101528        32.00
      11.887     0.971875       101853        35.56
      12.447     0.975000       102179        40.00
      13.215     0.978125       102509        45.71
      14.039     0.981250       102834        53.33
      15.087     0.984375       103162        64.00
      15.847     0.985938       103327        71.11
      16.671     0.987500       103489        80.00
      17.695     0.989062       103653        91.43
      18.991     0.990625       103818       106.67
      20.927     0.992188       103980       128.00
      22.287     0.992969       104062       142.22
      23.791     0.993750       104147       160.00
      25.135     0.994531       104225       182.86
      26.943     0.995313       104307       213.33
      29.039     0.996094       104390       256.00
      30.255     0.996484       104431       284.44
      31.727     0.996875       104472       320.00
      32.895     0.997266       104512       365.71
      35.359     0.997656       104553       426.67
      36.863     0.998047       104595       512.00
      38.047     0.998242       104614       568.89
      39.039     0.998437       104635       640.00
      40.095     0.998633       104655       731.43
      41.247     0.998828       104676       853.33
      42.783     0.999023       104696      1024.00
      44.127     0.999121       104707      1137.78
      45.055     0.999219       104717      1280.00
      45.823     0.999316       104728      1462.86
      46.815     0.999414       104737      1706.67
      48.767     0.999512       104747      2048.00
      50.047     0.999561       104752      2275.56
      53.151     0.999609       104759      2560.00
      55.647     0.999658       104763      2925.71
      56.383     0.999707       104768      3413.33
      57.887     0.999756       104773      4096.00
      58.527     0.999780       104775      4551.11
      62.655     0.999805       104778      5120.00
      66.047     0.999829       104781      5851.43
      66.495     0.999854       104783      6826.67
      70.655     0.999878       104786      8192.00
      70.783     0.999890       104787      9102.22
      72.063     0.999902       104788     10240.00
      72.767     0.999915       104790     11702.86
      73.087     0.999927       104791     13653.33
      75.647     0.999939       104792     16384.00
      76.607     0.999945       104793     18204.44
      76.607     0.999951       104793     20480.00
      78.591     0.999957       104794     23405.71
      80.639     0.999963       104795     27306.67
      80.639     0.999969       104795     32768.00
      80.831     0.999973       104796     36408.89
      80.831     0.999976       104796     40960.00
      80.831     0.999979       104796     46811.43
      83.135     0.999982       104797     54613.33
      83.135     0.999985       104797     65536.00
      83.135     0.999986       104797     72817.78
      83.135     0.999988       104797     81920.00
      83.135     0.999989       104797     93622.86
      89.151     0.999991       104798    109226.67
      89.151     1.000000       104798          inf
#[Mean    =        3.004, StdDeviation   =        3.931]
#[Max     =       89.088, Total count    =       104798]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  125068 requests in 1.02m, 24.56MB read
  Non-2xx or 3xx responses: 12540
Requests/sec:   2050.23  
Transfer/sec:    412.29KB
AUTOTEST_DONE